#language: ru
Функционал: Поиск товара и добавление в корзину


  @all
  @testIphone
  Сценарий: Проверить поиск товара и добавление в корзину
    Когда Вводится значение "iphone" в поле "Поиск" на странице "Стартовая страница"
    И Нажимается кнопка Поиска
    Когда Вводится значение "100000" в поле "Максимальная цена" на странице "Результирующая страница"
    И Нажимаем на чекбокс "Высокий рейтинг"
    И Нажимаем на чекбокс "NFC" в блоке беспроводных технологий
    И Добавляем в корзину 8 четных товаров
    И Переходим в корзину
    И Проверяем добавленные товары в корзине
    И Удаляем все товары из корзины
    И Проверям, есть ли заголовок "Корзина пуста"

    @all
    @testWirelessHeadphone
      Сценарий: Проверить поиск товара и добавление в корзину
      Когда Вводится значение "беспроводные наушники" в поле "Поиск" на странице "Стартовая страница"
      И Нажимается кнопка Поиска
      Когда Вводится значение "10000" в поле "Максимальная цена" на странице "Результирующая страница"
      И Нажимаем на чекбокс "Высокий рейтинг"
      И Нажимаем на кнопку 'Развенуть' в блоке "Бренды"
      И Выбираем бренд "Beats"
      И Выбираем бренд "Xiaomi"
      И Выбираем бренд "Samsung"
      И Добавляем в корзину 8 четных товаров
      И Переходим в корзину
      И Проверяем добавленные товары в корзине
      И Удаляем все товары из корзины
      И Проверям, есть ли заголовок "Корзина пуста"



    
